#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_s3_bucket.subdomain: Refreshing state... [id=www.aheadinthecloud.com]
data.aws_caller_identity.current: Reading...
aws_s3_bucket.domain: Refreshing state... [id=aheadinthecloud.com]
data.aws_caller_identity.current: Read complete after 0s [id=004351562122]
aws_s3_bucket_website_configuration.subdomain: Refreshing state... [id=www.aheadinthecloud.com]
aws_s3_bucket_website_configuration.domain: Refreshing state... [id=aheadinthecloud.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.logs will be created
  + resource "aws_s3_bucket" "logs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "logs.aheadinthecloud.com"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_logging.example will be created
  + resource "aws_s3_bucket_logging" "example" {
      + bucket        = "aheadinthecloud.com"
      + id            = (known after apply)
      + target_bucket = (known after apply)
      + target_prefix = "logs/"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @mmccarthy404, Action: `pull_request`, Working Directory: ``, Workflow: `terraform-ci`*